Repository: shadowamin/AirQualityByCity
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, pt

# app_name
source: Environment Challenge
ar: تحدي البيئة
de: Umwelt-Herausforderung
es: Desafío ambiental
fr: Défi Environnement
pt: Desafio Ambiental

# aqi_very_low_des
source: Air quality is considered great, and air pollution is rare
ar: تعتبر نوعية الهواء جيدة ، وتلوث الهواء نادر
de: Die Luftqualität wird als großartig angesehen, und Luftverschmutzung ist selten
es: La calidad del aire se considera excelente y la contaminación del aire es rara.
fr: La qualité de l'air est considérée comme excellente et la pollution de l'air est rare
pt: A qualidade do ar é considerada ótima e a poluição do ar é rara

source: Air quality
ar: جودة الهواء
de: Luftqualität
es: Calidad del aire
fr: Qualité de l'air
pt: Qualidade do ar

# aqi_low_des
source: Air quality is considered satisfactory, and air pollution poses little or no risk
ar: تعتبر نوعية الهواء مقبولة ، ولا يمثل تلوث الهواء أي مخاطر
de: Die Luftqualität wird als zufriedenstellend angesehen, und die Luftverschmutzung birgt nur ein geringes oder gar kein Risiko
es: La calidad del aire se considera satisfactoria y la contaminación del aire representa poco o ningún riesgo.
fr: La qualité de l'air est jugée satisfaisante et la pollution de l'air pose peu ou pas de risque
pt: A qualidade do ar é considerada satisfatória e a poluição do ar representa pouco ou nenhum risco

# aqi_mod_des
source: Air quality is acceptable; however, for some pollutants there may be a moderate health concern
ar: نوعية الهواء مقبولة. ومع ذلك ، قد يكون هناك قلق صحي معتدل بالنسبة لبعض الملوثات
de: Luftqualität ist akzeptabel; Für einige Schadstoffe kann es jedoch zu mäßigen gesundheitlichen Bedenken kommen
es: La calidad del aire es aceptable; sin embargo, para algunos contaminantes puede haber un problema de salud moderado
fr: La qualité de l'air est acceptable. Cependant, pour certains polluants, il peut y avoir un problème de santé modéré
pt: A qualidade do ar é aceitável; no entanto, para alguns poluentes, pode haver um problema de saúde moderado

# aqi_unh_low_des
source: Members of sensitive groups may experience health effects. The general public is not likely to be affected.
ar: قد يواجه الأشخاص الأكثر حساسية تأثيرات صحية. من غير المحتمل أن يتأثر الجمهور العام.
de: Mitglieder sensibler Gruppen können gesundheitliche Auswirkungen haben. Die breite Öffentlichkeit dürfte davon nicht betroffen sein.
es: Los miembros de grupos sensibles pueden experimentar efectos en la salud. El público en general no es probable que se vea afectado.
fr: Les membres des groupes sensibles peuvent avoir des effets sur la santé. Le grand public ne sera probablement pas affecté.
pt: Membros de grupos sensíveis podem sofrer efeitos na saúde. O público em geral não é suscetível de ser afetado.

# aqi_unh_des
source: Everyone may begin to experience health effects; members of sensitive groups may experience more serious health effects
ar: قد يوجه الجميع تاثيرات صحية ؛ قد يواجه الأشخاص الأكثر حساسية آثارًا صحية أكثر خطورة
de: Jeder kann beginnen, gesundheitliche Auswirkungen zu spüren. Angehörige empfindlicher Gruppen können schwerwiegendere gesundheitliche Auswirkungen haben
es: Todos pueden comenzar a experimentar efectos en la salud; los miembros de grupos sensibles pueden experimentar efectos de salud más graves
fr: Tout le monde peut commencer à ressentir des effets sur la santé ; les membres de groupes sensibles peuvent avoir des effets plus graves sur la santé
pt: Todos podem começar a sentir efeitos na saúde; membros de grupos sensíveis podem sofrer efeitos mais sérios sobre a saúde

# aqi_unh_very_des
source: Health warnings of emergency conditions. The entire population is more likely to be affected.
ar: التحذيرات الصحية من حالات الطوارئ. من المرجح أن يتأثر جميع السكان.
de: Gesundheitswarnungen bei Notfällen. Es ist wahrscheinlicher, dass die gesamte Bevölkerung betroffen ist.
es: Advertencias sanitarias de condiciones de emergencia. Es más probable que la población entera se vea afectada.
fr: Avertissements sanitaires relatifs aux conditions d'urgence. Toute la population est plus susceptible d'être touchée.
pt: Advertências de saúde de condições de emergência. Toda a população tem mais probabilidade de ser afetada.

# aqi_biohasard
source: Health alert: everyone may experience more serious health effects
ar: تنبيه صحي: قد يتعرض كل شخص لتأثيرات صحية أكثر خطورة
de: Gesundheitswarnung: Jeder kann schwerwiegendere gesundheitliche Auswirkungen haben
es: Alerta de salud: todos pueden experimentar efectos de salud más graves.
fr: Alerte santé : tout le monde peut avoir des effets plus graves sur la santé
pt: Alerta de saúde: todos podem experimentar efeitos mais graves para a saúde

# aqi_title
source: Real time Air Quality
ar: جودة الهواء حالياً
de: Echtzeit-Luftqualität
es: Calidad del aire en tiempo real
fr: Qualité de l'air en temps réel
pt: Qualidade do Ar em Tempo Real

# aqi_very_low
source: Very Good
ar: جيد جدا
de: Sehr gut
es: Muy bien
fr: Très bon
pt: Muito bom

# aqi_low
source: Good
ar: حسن
de: Gut
es: Bueno
fr: Bien
pt: Boa

# aqi_mod
source: Moderate
ar: معتدل
de: Mäßig
es: Moderar
fr: Modéré
pt: Moderado

# aqi_unh_low
source: Unhealthy for Sensitive Groups
ar: غير صحي للأشخاص الأكثر حساسية
de: Ungesund für sensible Gruppen
es: No saludable para grupos sensibles
fr: Malsain pour les groupes sensibles
pt: Insalubre para grupos sensíveis

# aqi_unh
source: Unhealthy
ar: غير صحي
de: Ungesund
es: Insalubre
fr: Mauvais pour la santé
pt: Pouco saudável

# aqi_unh_very
source: Very Unhealthy
ar: غير صحية جدا
de: sehr ungesund
es: muy poco saludable
fr: Très malsain
pt: muito prejudicial à saúde

# aqi_hazardous
source: Hazardous
ar: خطير
de: Gefährlich
es: Peligroso
fr: Hasardeux
pt: Perigoso

# location_permission_request
source: Environment challenge collects location to calculate Air quality nearby, only when the app is in foreground
ar: يجمع تحدي البيئة الموقع لقيس جودة الهواء في مكان قريب، فقط عند إستخدام هذه الخاصية
de: Umwelt-Herausforderung sammelt den Standort, um die Luftqualität in der Nähe zu berechnen, nur wenn die App im Vordergrund ist
es: El desafío ambiental recopila la ubicación para calcular la calidad del aire cerca, solo cuando la aplicación está en primer plano
fr: Défi Environnement collecte l'emplacement pour calculer la qualité de l'air à proximité, uniquement à l'utilisation de cette fonctionnalité
pt: Desafio Ambiental coleta a localização para calcular a qualidade do ar nas proximidades, somente quando o aplicativo está em primeiro plano

# aqi_permission
source: Need permission to access location to calculate air quality
ar: نحن بحاجة لإذنك لمعرفة الموقع حتى نحدد جودة الهوء في منطقتك
de: Für die Berechnung der Luftqualität ist eine Erlaubnis zum Zugriff auf den Standort erforderlich
es: Necesita permiso para acceder a la ubicación para calcular la calidad del aire
fr: Besoin d'une permission pour accéder à un lieu afin de calculer la qualité de l'air
pt: Precisa de permissão para acessar o local para calcular a qualidade do ar

# epi_air_quality
source: Air quality
ar: جودة الهواء
de: Luftqualität
es: Calidad del aire
fr: Qualité de l'air
pt: Qualidade do ar
